package com.jiabangou.mtwmsdk.model;

/**
 * Created by wanglei on 16-9-30.
 */
public interface OrderCancelReasonCode {

//    美团发送的取消原因列表
//
//    原因code	原因描述
//    Integer APPLY =  1001	系统取消，超时未确认
//    1002	系统取消，在线支付订单30分钟未支付
//    1101	用户取消，在线支付中取消
//    1102	用户取消，商家确认前取消
//    1103	用户取消，用户退款取消
//    1201	客服取消，用户下错单
//    1202	客服取消，用户测试
//    1203	客服取消，重复订单
//    1204	客服取消，其他原因
//    1301	其他原因
//    APP方发出、美团接收的取消原因列表
//
//    原因code	原因描述
//    2001	APP方商家超时接单
//    2002	APP方非顾客原因修改订单
//    2003	APP方非顾客原因取消订单
//    2004	APP方配送延迟
//    2005	APP方售后投诉
//    2006	APP方用户要求取消
//    2007	APP方其他原因取消（未传code，默认为此原因）

}
